/*3. Напишите программу, которая будет выдавать
название дня недели по заданному номеру.
3 -> Среда
5 -> Пятница
Console.WriteLine("Hello, World!");*/
Console.WriteLine("Введите дату: ");
int number = Convert.ToInt32(Console.ReadLine());
int Monday = 1
int square = number * number;
    if (square == numberB)
    {
        Console.WriteLine($"Квадратом числа {numberA} является число {numberB}");
    }
    else
    {
        Console.WriteLine($"Квадратом числа {numberA} не является число {numberB}");
    }